<template>
  <div class="card">
    <h2 class="titlenews_style">
      Интересные новости SpaceX | {{dateNow}}
    </h2>
    <span class="viewsrate_style">
      Просмотров новостей: {{viewsRate}} | Прочитано: {{readRate}}
    </span>
    
    <div class="card_news">
      <news-blocks v-for="item in news" :key="item.id"
      :id="item.id"
      :title="item.title"
      :text="item.text"
      :is-open="item.isOpen"
      :is-read="item.isRead"
      @open-news="openNews"
      @read-news="readNews"
      @unread-news="unReadNews"
      ></news-blocks>
    </div>
  </div>
</template>


<script>
import NewsBlocks from './NewsBlocks'

export default {
  data() {
    return {
      dateNow: new Date().toLocaleDateString(),
      viewsRate: 0,
      readRate: 0,
      news: [
        {
          id: 1,
          title: 'SpaceX будет доставлять астронавтов на Луну.',
          text: 'Компания американского предпринимателя Илона Маска SpaceX выиграла контракт NASA по доставке астронавтов на Луну в рамках программы «Артемида». Об этом сообщается на сайте американского космического ведомства.',
          isOpen: false,
          isRead: false },
        {
          id: 2,
          title: 'Во Флориде стартовала ракета Falcon 9.',
          text: 'Ракета-носитель Falcon 9 стартовала во Флориде с очередной партией интернет-спутников Starlink, компания SpaceX ведет прямую трансляцию запуска.',
          isOpen: false,
          isRead: false },
        {
          id: 3,
          title: 'Взрыв прототипа корабля Starship.',
          text: 'SN11 взорвался в ходе испытаний в американском штате Техас 30 марта. Это уже третье неудачное испытание в этом году. Прототип SN10 взорвался спустя несколько минут после посадки в ходе испытаний в начале марта, до этого в феврале взорвался прототип корабля SN9 после тестового подъема на высоту 10 километров.',
          isOpen: false,
          isRead: false },
        {
          id: 4,
          title: 'Причиной ложного сигнала о пожаре и разгерметизации на МКС стал Crew Dragon.',
          text: 'Некорректная работа программного обеспечения пилотируемого корабля Crew Dragon американской компании SpaceX, главой которой является Илон Маск, стала причиной ложного срабатывания сигнализации о пожаре и разгерметизации на Международной космической станции (МКС). Такая информация следует из переговоров экипажа станции с Землей, транслируемых NASA 24 марта.',
          isOpen: false,
          isRead: false },
        {
          id: 5,
          title: 'Турецкий инженер рассказал о тяжелых условиях работы на Илона Маска.',
          text: 'Турецкий инженер Бюлент Алтан, который принимал участие в разработке первой ракеты американской компании SpaceX Falcon-1, обвинил ее владельца Илона Маска в том, что он обращался с сотрудниками как с рабами. Об этом 5 марта сообщило издание Hürriyet Daily News. «Нас оставили одних на острове», — рассказал Алтан в своей книге «Взлет». Речь идет о начале 2000-х и крошечном острове Омелек, расположенном в Тихом океане. Как утверждает инженер, владелец SpaceX настаивал на том, что они «обязаны преуспеть».',
          isOpen: false,
          isRead: false },
        {
          id: 6,
          title: 'Российский космонавт Корсаков может полететь на Crew Dragon.',
          text: 'Сергей Корсаков станет одним из первых участников полета на Crew Dragon. Российский космонавт должен был лететь на «Союзе МС-18». Раннее предполагалось, что на МКС Корсаков отправится 9 апреля, сообщает телеканал «Известия». Теперь же по договоренности с НАСА россиянина заменит Марк Ванде Хай. Разработанный SpaceX по заказу НАСА Crew Dragon отправится на МКС в 2023 году.',
          isOpen: false,
          isRead: false },
        {
          id: 7,
          title: 'SpaceX построит для NASA лунный посадочный модуль.',
          text: 'SpaceX будет доставлять астронавтов на Луну. Компания Илона Маска выиграла контракт NASA, передает телеканал «Известия». На создание посадочного модуля выделят $2,89 млрд. Предполагается, что аппарат будет рассчитан на двух человек. Высадку планируют произвести в 2024 году. Всего лунная программа под названием Артемида предусматривает три полета к спутнику Земли. Первый этап — в 2021 году уже в этом году. Корабль Orion должен облететь Луну без экипажа и вернуться на Землю.',
          isOpen: false,
          isRead: false },
      ]
    }
  },

  methods: {
    openNews() {
      this.viewsRate++
    },

    readNews(id) {
      const index = this.news.findIndex(news => news.id === id)
      this.news[index].isRead = true
      this.readRate++
    },

    unReadNews(id) {
      const index = this.news.findIndex(news => news.id === id)
      this.news[index].isRead = false
      this.readRate--
    }
  },

  components: {
    'news-blocks': NewsBlocks
  }
}
</script>